Repository: aschneiderGit/converter
Catalog: lib/core/l10n/app_*.arb
Languages: fr

# titleApp
source: Converter
fr: Convertisseur

# appBar
source: Start to convert here !
fr: Commencez à convertir ici !

# noConnectionAtInitTitle
source: Need internet connection
fr: Connection internet nécessaire

# noConnectionAtInitMessage
source: For your first usage of the app you need an internet connection to fetch the initial value of the converter currency
fr: Au premier lancement de l'app, vous avez besoin d'être connecté à internet pour pouvoir charger les taux initiaux

source: Search currency...
fr: Chercher une devise...

# noCurrency
source: No currencies available
fr: Pas de devise disponible

source: Select Currency
fr: Selection de device

# enterAmount
source: Enter your amount
fr: Entrer votre somme

# canAcessDataTitle
source: Can't access to the Exchangerate API
fr: Exchangerate API n'est pas acessible

# canAcessDataMessage
source: Check your connection internet, or the Exchangerate API status
fr: Vérifier votre connection internet, ou le status de l'api Exchangerate

source: Data updated
fr: Données mise à jour

# dataUpToDate
source: Data already up to date (it refresh only every 24h)
fr: Données déjà à jour (elles s'actualisent toute les 24h seulement)

# updateTime
source: Data updated
fr: Données mise à jour il y a

# attribution
source: Rates By Exchange Rate API
fr: Taux reçu par Exchange Rate API

# hour
source: {count, plural, =1{1 hour} other{{count} hours}}
fr: {count, plural, =1{1 heure} other{{count} heures}}

# day
source: {count, plural, =1{1 day} other{{count} days}}
fr: {count, plural, =1{1 jour} other{{count} jours}}

# month
source: {count, plural, =1{1 month} other{{count} months}}
fr: {count, plural, =1{1 mois} other{{count} mois}}

# year
source: {count, plural, =1{1 year} other{{count} years}}
fr: {count, plural, =1{1 an} other{{count} ans}}

source: Cancel
fr: Annuler
